- Load a file

In [11]:
import pandas as pd

In [12]:
items = {'Paul': [10, 20, 30],
            'John': [40, 50, 60],
            'Mary': [70, 80, 90]}
df = pd.DataFrame(items)
df

   Paul  John  Mary
0    10    40    70
1    20    50    80
2    30    60    90

In [13]:
items = {'Paul': pd.Series([10, 20, 30], ['Apple', 'Banana', 'Mango']),
            'John': pd.Series([40, 50, 60], ['Fresa', 'Arandanos', 'Limon']),
            'Mary': pd.Series([70, 80, 90], ['Naranja', 'Platano', 'Cereza'])}

df = pd.DataFrame(items)
df

           Paul  John  Mary
Apple      10.0   NaN   NaN
Arandanos   NaN  50.0   NaN
Banana     20.0   NaN   NaN
Cereza      NaN   NaN  90.0
Fresa       NaN  40.0   NaN
Limon       NaN  60.0   NaN
Mango      30.0   NaN   NaN
Naranja     NaN   NaN  70.0
Platano     NaN   NaN  80.0

In [14]:
df.index

Index(['Apple', 'Arandanos', 'Banana', 'Cereza', 'Fresa', 'Limon', 'Mango',
       'Naranja', 'Platano'],
      dtype='object')

In [15]:
df.values

array([[10., nan, nan],
       [nan, 50., nan],
       [20., nan, nan],
       [nan, nan, 90.],
       [nan, 40., nan],
       [nan, 60., nan],
       [30., nan, nan],
       [nan, nan, 70.],
       [nan, nan, 80.]])

In [16]:
df.columns

Index(['Paul', 'John', 'Mary'], dtype='object')

In [17]:
df.shape

(9, 3)

In [20]:
df = pd.DataFrame(items, columns = ['Paul'], index = ['apple', 'banana'])
df

        Paul
apple    NaN
banana   NaN